#+TITLE: Test Terraformer
* Check gsutil auth
#+BEGIN_SRC shell
gcloud auth list 2>&1
:
#+END_SRC

#+RESULTS:
#+begin_example

No credentialed accounts.

To login, run:
  $ gcloud auth login `ACCOUNT`

#+end_example
* Repo we are working with
git clone https://github.com/GoogleCloudPlatform/terraformer 2>&1
* Install terrraformer - This took a bit of tweaking
I am not sure why it did not initially work,
I think I might not have run terraform init or something similar.
I tried to
#+BEGIN_SRC tmate
export PROVIDER={google,aws,kubernetes,all}
curl -LO https://github.com/GoogleCloudPlatform/terraformer/releases/download/$(curl -s https://api.github.com/repos/GoogleCloudPlatform/terraformer/releases/latest | grep tag_name | cut -d '"' -f 4)/terraformer-${PROVIDER}-linux-amd64
chmod +x terraformer-${PROVIDER}-linux-amd64
sudo cp terraformer-${PROVIDER}-linux-amd64 /usr/local/bin/terraformer
#+END_SRC
Only use this one if you want a version that is not latest.
#+BEGIN_SRC tmate
export PROVIDER={google,aws,kubernetes,all}
curl -LO https://github.com/GoogleCloudPlatform/terraformer/releases/download/$(curl -s https://api.github.com/repos/GoogleCloudPlatform/terraformer/releases/tags/0.8.11 | grep tag_name | cut -d '"' -f 4)/terraformer-${PROVIDER}-linux-amd64
chmod +x terraformer-${PROVIDER}-linux-amd64
sudo cp terraformer-${PROVIDER}-linux-amd64 /usr/local/bin/terraformer
#+END_SRC
#+BEGIN_SRC tmate
cd ~/
mkdir ~/foo
cd ~/foo
#+END_SRC
#+BEGIN_SRC :tangle "/home/ii/foo/versions.tf"
terraform {
  required_providers {
    google = {
      source = "hashicorp/google"
    }
  }
  required_version = ">= 0.13"
}
#+END_SRC
#+BEGIN_SRC tmate
terraform init
#+END_SRC
* Install terrafarmer from source -- Did not need this at the end
When the above did not work initially I went through these steps.
They turned out not to be necessary
#+BEGIN_SRC tmate
git clone https://github.com/GoogleCloudPlatform/terraformer
#+END_SRC
#+BEGIN_SRC tmate
cd terraformer
#+END_SRC
#+BEGIN_SRC tmate
go mod download
#+END_SRC
#+BEGIN_SRC tmate
go build -v
#+END_SRC
#+BEGIN_SRC :tangle "/home/ii/terraformer/versions.tf"
terraform {
  required_providers {
    google = {
      source = "hashicorp/google"
    }
  }
  required_version = ">= 0.13"
}
#+END_SRC
#+BEGIN_SRC tmate
terraform init versions.tf
#+END_SRC
Above failed with Error checking configuration: <nil>

Lets manually install the plugins:
#+BEGIN_SRC tmate
curl https://releases.hashicorp.com/terraform-provider-google/3.66.1/terraform-provider-google_3.66.1_linux_amd64.zip --output terraform-provider-google.zip &&
cp terraform-provider-google.zip ~/.terraform/plugins/linux_amd64/ &&
#+END_SRC

* Import GCS for apisnoop
To get this to auth you need to log into application-default.
#+BEGIN_SRC tmate
gcloud auth application-default login
#+END_SRC
#+BEGIN_SRC tmate
terraformer import google --resources=gcs --projects=apisnoop
#+END_SRC
#+BEGIN_SRC tmate
pwd
#+END_SRC
